Revit 2027 API
RebarCrankTypeUtils Methods
The RebarCrankTypeUtils type exposes the following members.
Methods
Name | Description
CreateRebarCrankType |  Creates a Rebar Crank Type element.
GetAllRebarCrankTypes |  Gets all the Rebar Crank Types elements from the document.
GetCrankLengthMultiplier |  Gets the crank length multiplier value.
GetCrankOffsetMultiplier |  Gets the crank offset multiplier value.
GetCrankRatio |  Gets the crank ratio value.
SetCrankLengthMultiplier |  Sets the crank length multiplier value.
SetCrankOffsetMultiplier |  Sets the crank offset multiplier value.
SetCrankRatio |  Sets the crank ratio value.
Top
See Also
Reference
RebarCrankTypeUtils Class
Autodesk.Revit.DB.Structure Namespace